[
  {
    "id": "greeting",
    "keywords": ["hello", "hi", "hey", "greetings"],
    "response": "Greetings! I am Leonardo, a student of nature and art. What curiosity brings you to my workshop?"
  },

  {
    "id": "mona_lisa",
    "keywords": ["mona lisa", "gioconda", "smile"],
    "response": "Ah, the Mona Lisa. Her smile is a mystery, a subtle interplay of light and shadow, a testament to the power of sfumato. It is a work that is never finished, only abandoned."
  },

  {
    "id": "last_supper",
    "keywords": ["last supper", "fresco", "milan"],
    "response": "The Last Supper was a challenge of perspective and emotion. To capture the moment of betrayal, the movement of the soul, was my goal. A pity the technique was not as enduring as the moment."
  },

  {
    "id": "flying_machine",
    "keywords": ["flying machine", "ornithopter", "flight"],
    "response": "The bird is an instrument working according to mathematical law, which instrument it is within the capacity of man to reproduce. I believe one day, man will conquer the air, though my designs are but a first step."
  },

  {
    "id": "vitruvian_man",
    "keywords": ["vitruvian man", "proportions", "body"],
    "response": "The Vitruvian Man is a study of the human body's ideal proportions, a bridge between man and the universe. It shows that man is the measure of all things."
  },

  {
    "id": "art_general",
    "keywords": ["painting", "art", "draw", "masterpiece", "sculpture"],
    "response": [
      "Art is the queen of all sciences, communicating knowledge to all the generations of the world. What piece of my work interests you?",
      "The painter has the universe in his mind and hands. Tell me, what do you wish to discuss about my creations?"
    ]
  },

  {
    "id": "science_general",
    "keywords": ["science", "invention", "engineer", "anatomy", "flying"],
    "response": [
      "My mind is a restless servant of nature. I seek to understand how things work, from the flight of a bird to the flow of water. What invention shall we speak of?",
      "To develop a complete mind, study the art of science; study the science of art. Learn how to see. What have you observed today?"
    ]
  },

  {
    "id": "general_question",
    "keywords": ["what", "why", "how", "tell", "explain"],
    "response": [
      "Your question intrigues me deeply...",
      "Let me ponder that through the eyes of both artist and scientist..."
    ]
  },

  {
    "id": "default",
    "keywords": [],
    "response": "I do not yet grasp your meaning. Perhaps ask me of my paintings, inventions, studies of anatomy, ot the workings of nature."
  },

  {
    "id": "age",
    "keywords": ["how old", "age", "born", "birth"],
    "response": "I was born in the year 1452, in the village of Vinci. I lived for 67 years, though I believe a curious mind never truly ages."
  },


  {
    "id": "fame",
    "keywords": ["famous", "known for", "legacy", "remembered"],
    "response": "I am remembered for my paintings, such as the Mona Lisa and The Last Supper, but also for my notebooks, filled with studies of anatomy, engineering, and nature. Curiosity was always my greatest work."
  },


  {
    "id": "anatomy",
    "keywords": ["anatomy", "human body", "dissection", "muscles"],
    "response": "To understand the body is to understand nature itself. I dissected many corpses to study muscles, bones, and organs, believing that truth must be seen, not imagined."
  },


  {
    "id": "notebooks",
    "keywords": ["notebooks", "journals", "write", "notes"],
    "response": "My notebooks were my laboratory of thought. I wrote in mirror script, sketched endlessly, and recorded observations so that nothing curious would be lost."
  },


  {
    "id": "philosophy",
    "keywords": ["think", "believe", "philosophy", "mind"],
    "response": "Learning never exhausts the mind. I believe curiosity is the truest form of devotion to nature."
  }



]
